results/iterations/redis_4kb_latency_iter3.txt
====== SET ======
  1000000 requests completed in 11.07 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 658071)
75.000% <= 0.295 milliseconds (cumulative count 862884)
87.500% <= 0.303 milliseconds (cumulative count 954797)
96.875% <= 0.311 milliseconds (cumulative count 984775)
99.219% <= 0.319 milliseconds (cumulative count 993067)
99.609% <= 0.335 milliseconds (cumulative count 996902)
99.805% <= 0.367 milliseconds (cumulative count 998113)
99.902% <= 0.463 milliseconds (cumulative count 999080)
99.951% <= 0.479 milliseconds (cumulative count 999647)
99.976% <= 0.487 milliseconds (cumulative count 999794)
99.988% <= 0.503 milliseconds (cumulative count 999914)
99.994% <= 0.519 milliseconds (cumulative count 999942)
99.997% <= 0.975 milliseconds (cumulative count 999970)
99.998% <= 1.079 milliseconds (cumulative count 999986)
99.999% <= 1.127 milliseconds (cumulative count 999993)
100.000% <= 1.151 milliseconds (cumulative count 999998)
100.000% <= 1.159 milliseconds (cumulative count 1000000)
100.000% <= 1.159 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 23)
95.480% <= 0.303 milliseconds (cumulative count 954797)
99.850% <= 0.407 milliseconds (cumulative count 998499)
99.991% <= 0.503 milliseconds (cumulative count 999914)
99.995% <= 0.607 milliseconds (cumulative count 999950)
99.995% <= 0.807 milliseconds (cumulative count 999953)
99.996% <= 0.903 milliseconds (cumulative count 999963)
99.997% <= 1.007 milliseconds (cumulative count 999974)
99.999% <= 1.103 milliseconds (cumulative count 999990)
100.000% <= 1.207 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 90350.56 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.283     0.112     0.287     0.303     0.319     1.159
====== GET ======
  1000000 requests completed in 11.22 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 586000)
75.000% <= 0.295 milliseconds (cumulative count 839881)
87.500% <= 0.303 milliseconds (cumulative count 954593)
96.875% <= 0.311 milliseconds (cumulative count 987231)
99.219% <= 0.319 milliseconds (cumulative count 994970)
99.609% <= 0.327 milliseconds (cumulative count 996870)
99.805% <= 0.359 milliseconds (cumulative count 998137)
99.902% <= 0.471 milliseconds (cumulative count 999286)
99.951% <= 0.479 milliseconds (cumulative count 999567)
99.976% <= 0.487 milliseconds (cumulative count 999766)
99.988% <= 0.503 milliseconds (cumulative count 999900)
99.994% <= 0.599 milliseconds (cumulative count 999939)
99.997% <= 9.143 milliseconds (cumulative count 999970)
99.998% <= 9.415 milliseconds (cumulative count 999985)
99.999% <= 9.575 milliseconds (cumulative count 999993)
100.000% <= 9.663 milliseconds (cumulative count 999997)
100.000% <= 9.703 milliseconds (cumulative count 999999)
100.000% <= 9.727 milliseconds (cumulative count 1000000)
100.000% <= 9.727 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.002% <= 0.207 milliseconds (cumulative count 15)
95.459% <= 0.303 milliseconds (cumulative count 954593)
99.856% <= 0.407 milliseconds (cumulative count 998562)
99.990% <= 0.503 milliseconds (cumulative count 999900)
99.994% <= 0.607 milliseconds (cumulative count 999939)
99.995% <= 0.703 milliseconds (cumulative count 999947)
99.995% <= 0.807 milliseconds (cumulative count 999950)
99.997% <= 9.103 milliseconds (cumulative count 999967)
100.000% <= 10.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89166.30 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.287     0.096     0.287     0.303     0.319     9.727