results/iterations/redis_4kb_latency_iter4.txt
====== SET ======
  1000000 requests completed in 11.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.295 milliseconds (cumulative count 717710)
75.000% <= 0.303 milliseconds (cumulative count 874901)
87.500% <= 0.311 milliseconds (cumulative count 944151)
96.875% <= 0.319 milliseconds (cumulative count 969224)
98.438% <= 0.343 milliseconds (cumulative count 985744)
99.219% <= 0.399 milliseconds (cumulative count 992502)
99.609% <= 0.487 milliseconds (cumulative count 996175)
99.805% <= 0.575 milliseconds (cumulative count 998145)
99.902% <= 0.631 milliseconds (cumulative count 999075)
99.951% <= 0.679 milliseconds (cumulative count 999514)
99.976% <= 0.711 milliseconds (cumulative count 999768)
99.988% <= 0.783 milliseconds (cumulative count 999878)
99.994% <= 0.975 milliseconds (cumulative count 999942)
99.997% <= 1.079 milliseconds (cumulative count 999970)
99.998% <= 1.207 milliseconds (cumulative count 999985)
99.999% <= 1.247 milliseconds (cumulative count 999993)
100.000% <= 1.279 milliseconds (cumulative count 999997)
100.000% <= 1.287 milliseconds (cumulative count 999999)
100.000% <= 1.303 milliseconds (cumulative count 1000000)
100.000% <= 1.303 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.002% <= 0.207 milliseconds (cumulative count 17)
87.490% <= 0.303 milliseconds (cumulative count 874901)
99.314% <= 0.407 milliseconds (cumulative count 993141)
99.689% <= 0.503 milliseconds (cumulative count 996888)
99.867% <= 0.607 milliseconds (cumulative count 998673)
99.972% <= 0.703 milliseconds (cumulative count 999724)
99.991% <= 0.807 milliseconds (cumulative count 999906)
99.993% <= 0.903 milliseconds (cumulative count 999929)
99.996% <= 1.007 milliseconds (cumulative count 999957)
99.997% <= 1.103 milliseconds (cumulative count 999972)
99.999% <= 1.207 milliseconds (cumulative count 999985)
100.000% <= 1.303 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 87842.59 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.292     0.096     0.295     0.319     0.375     1.303
====== GET ======
  1000000 requests completed in 11.26 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 536959)
75.000% <= 0.295 milliseconds (cumulative count 800592)
87.500% <= 0.303 milliseconds (cumulative count 937349)
93.750% <= 0.311 milliseconds (cumulative count 981436)
98.438% <= 0.319 milliseconds (cumulative count 992963)
99.609% <= 0.327 milliseconds (cumulative count 996252)
99.805% <= 0.351 milliseconds (cumulative count 998274)
99.902% <= 0.463 milliseconds (cumulative count 999054)
99.951% <= 0.479 milliseconds (cumulative count 999685)
99.976% <= 0.487 milliseconds (cumulative count 999820)
99.988% <= 0.495 milliseconds (cumulative count 999882)
99.994% <= 0.599 milliseconds (cumulative count 999944)
99.997% <= 1.063 milliseconds (cumulative count 999970)
99.998% <= 1.327 milliseconds (cumulative count 999985)
99.999% <= 1.487 milliseconds (cumulative count 999993)
100.000% <= 1.575 milliseconds (cumulative count 999997)
100.000% <= 1.615 milliseconds (cumulative count 999999)
100.000% <= 1.631 milliseconds (cumulative count 1000000)
100.000% <= 1.631 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 16)
93.735% <= 0.303 milliseconds (cumulative count 937349)
99.869% <= 0.407 milliseconds (cumulative count 998692)
99.991% <= 0.503 milliseconds (cumulative count 999906)
99.995% <= 0.607 milliseconds (cumulative count 999950)
99.995% <= 0.807 milliseconds (cumulative count 999953)
99.996% <= 0.903 milliseconds (cumulative count 999959)
99.997% <= 1.007 milliseconds (cumulative count 999966)
99.997% <= 1.103 milliseconds (cumulative count 999972)
99.998% <= 1.207 milliseconds (cumulative count 999978)
99.998% <= 1.303 milliseconds (cumulative count 999984)
99.999% <= 1.407 milliseconds (cumulative count 999989)
99.999% <= 1.503 milliseconds (cumulative count 999994)
100.000% <= 1.607 milliseconds (cumulative count 999998)
100.000% <= 1.703 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88849.40 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.288     0.112     0.287     0.311     0.319     1.631