results/iterations/redis_4kb_latency_iter5.txt
====== SET ======
  1000000 requests completed in 11.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.095 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 606131)
75.000% <= 0.295 milliseconds (cumulative count 836790)
87.500% <= 0.303 milliseconds (cumulative count 945620)
96.875% <= 0.311 milliseconds (cumulative count 979363)
98.438% <= 0.319 milliseconds (cumulative count 988147)
99.219% <= 0.343 milliseconds (cumulative count 992857)
99.609% <= 0.423 milliseconds (cumulative count 996183)
99.805% <= 0.495 milliseconds (cumulative count 998097)
99.902% <= 0.551 milliseconds (cumulative count 999070)
99.951% <= 0.583 milliseconds (cumulative count 999570)
99.976% <= 0.607 milliseconds (cumulative count 999786)
99.988% <= 0.647 milliseconds (cumulative count 999879)
99.994% <= 1.103 milliseconds (cumulative count 999940)
99.997% <= 1.391 milliseconds (cumulative count 999970)
99.998% <= 1.503 milliseconds (cumulative count 999985)
99.999% <= 1.575 milliseconds (cumulative count 999993)
100.000% <= 1.615 milliseconds (cumulative count 999997)
100.000% <= 1.647 milliseconds (cumulative count 1000000)
100.000% <= 1.647 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.002% <= 0.207 milliseconds (cumulative count 17)
94.562% <= 0.303 milliseconds (cumulative count 945620)
99.591% <= 0.407 milliseconds (cumulative count 995906)
99.830% <= 0.503 milliseconds (cumulative count 998297)
99.979% <= 0.607 milliseconds (cumulative count 999786)
99.989% <= 0.703 milliseconds (cumulative count 999891)
99.990% <= 0.807 milliseconds (cumulative count 999903)
99.991% <= 0.903 milliseconds (cumulative count 999911)
99.992% <= 1.007 milliseconds (cumulative count 999924)
99.994% <= 1.103 milliseconds (cumulative count 999940)
99.995% <= 1.207 milliseconds (cumulative count 999952)
99.996% <= 1.303 milliseconds (cumulative count 999958)
99.997% <= 1.407 milliseconds (cumulative count 999972)
99.999% <= 1.503 milliseconds (cumulative count 999985)
100.000% <= 1.607 milliseconds (cumulative count 999996)
100.000% <= 1.703 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89381.48 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.088     0.287     0.311     0.327     1.647
====== GET ======
  1000000 requests completed in 11.18 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.135 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 613373)
75.000% <= 0.295 milliseconds (cumulative count 852303)
87.500% <= 0.303 milliseconds (cumulative count 957394)
96.875% <= 0.311 milliseconds (cumulative count 987122)
99.219% <= 0.319 milliseconds (cumulative count 994011)
99.609% <= 0.335 milliseconds (cumulative count 996810)
99.805% <= 0.399 milliseconds (cumulative count 998052)
99.902% <= 0.471 milliseconds (cumulative count 999117)
99.951% <= 0.487 milliseconds (cumulative count 999730)
99.976% <= 0.495 milliseconds (cumulative count 999855)
99.988% <= 0.503 milliseconds (cumulative count 999931)
99.994% <= 0.511 milliseconds (cumulative count 999944)
99.997% <= 0.559 milliseconds (cumulative count 999976)
99.998% <= 0.567 milliseconds (cumulative count 999985)
99.999% <= 0.575 milliseconds (cumulative count 999994)
100.000% <= 0.583 milliseconds (cumulative count 1000000)
100.000% <= 0.583 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 0.207 milliseconds (cumulative count 11)
95.739% <= 0.303 milliseconds (cumulative count 957394)
99.828% <= 0.407 milliseconds (cumulative count 998284)
99.993% <= 0.503 milliseconds (cumulative count 999931)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89477.45 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.128     0.287     0.303     0.319     0.583